examples/openfoam_airfoil_pythonscript/airfoil_running/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
14336
(
-1.75636e-06
-1.75636e-06
-1.75636e-06
-1.75637e-06
-1.75637e-06
-1.75638e-06
-1.75638e-06
-1.75639e-06
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
224
(
-493.568
-493.726
-494.105
-494.954
-496.425
-498.272
-500.05
-501.495
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
-1.75636e-06
1.8634e-06
-5.94819e-06
6.05523e-06
-1.1465e-05
1.1572e-05
-1.87256e-05
1.88326e-05
...
)
;
    }
    airfoil
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
-0.000298368
-0.000938539
-0.00167079
-0.00250637
-0.00345726
-0.00453603
-0.00575558
-0.00712883
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
